sforganization/20190613/0em/STM32F103_one_angle_module/HARDWARE/COMMENT/SysComment.c

#include <string.h>
#include <stdio.h>
#include <stdlib.h>

#include "usart1.h" 
#include "usart3.h" 
#include "delay.h"

#include "SysComment.h"
#include "stm32f10x_it.h"
#include "stm32f10x_iwdg.h"
#include "san_flash.h"
#include "ws2812b.h"
#include "beep.h"




#define SLAVE_WAIT_TIME 		3000		//3s 从机应答时间

#define LOCK_SET_L_TIME 		50			//低电平时间 25 ~ 60ms
#define LOCK_SET_H_TIME 		50			//高电平时间
#define LOCK_SET_OFF_TIME		1200		//给单片机反应时间，电机回正之后再转

#define MOTO_UP_TIME			800			//电机上升时间
#define MOTO_DOWN_TIME			1500		//电机下降时间

#define POWER_ON_DELAY			250 		//上电一段时间再去使用 指纹模块，实际1020A 需要200ms					 1020C 需要100ms ,注意后面的操作还要加上多次操作，防止芯片差异造成的影响

#define LOCK_OPEN_TIME			500			//开锁给低电平时间

#define STREAM_TIME 			150			//流水时间
#define BLINK_TIME				240			//闪烁时间
#define FAILED_TIME 			160			//闪烁时间

#define BLINK_CNT_1 			2			//闪烁次数
#define BLINK_CNT_5 			10			//闪烁次数 00 /2 =5次
#define BLINK_CNT_6 			12			//闪烁次数 00 /2 =5次
#define BLINK_CNT_8 			16			//闪烁次数 00 /2 =5次
#define BLINK_CNT_10			20			//闪烁次数


#define KEY_PRESS_TIME			6000		//按键按下时间	3S长按是清除所有用户
#define KEY_DEBOUCH_TIME		40			//按键消抖时间40ms
#define KEY_SHORT_TIME			3000		//短按时间


#define ROOT_ID_NUM_1			1			//1020A 因为要抬手录入两次指纹，所以相当于一个指纹占用两个ID
#define ROOT_ID_NUM_2			2


#define RECV_PAKAGE_CHECK		10	 // 	10个数据检验

static bool 	g_bSensorState = TRUE;

typedef enum 
{
ACK_SUCCESS = 0,									//成功
ACK_FAILED, 										//失败
ACK_AGAIN,											//再次输入
ACK_ERROR,											//命令出错
ACK_DEF = 0xFF, 
} Finger_Ack;


//内部变量
static vu16 	mDelay;
u8				g_GlassSendAddr = 0; //要发送的手表地址
u8				g_FingerAck = 0; //应答数据命令
u8				g_AckType = 0; //应答类型



u32 			g_au32DataSaveAddr[6] =
{
	//103ze 512K
	//	0x0807D000, 
	//	0x0807D800, 
	//	0x0807E000, 
	//	0x0807E800, 
	//	0x0807F000, 
	//	0x0807F800
	//103c8  64K
	0X0800E800, 
	0X0800EC00, 
	0x0800F000, 
	0x0800F400, 
	0x0800F800, 
	0x0800FC00
};


vu32			g_au16MoteTime[][3] =
{
	//{
	//	MOTO_TIME_OFF, 0, 0
	//},	
	{
		MOTO_TIME_TPD, 43200000, 43200000
	},
	{
		MOTO_TIME_650, 120000, 942000
	},
	{
		MOTO_TIME_750, 120000, 800000
	},
	{
		MOTO_TIME_850, 120000, 693000
	},
	{
		MOTO_TIME_1000, 120000, 570000
	},
	{
		MOTO_TIME_1950, 120000, 234000
	},
	{
		MOTO_TIME_ANGLE, MOTO_ANGLE_TIME, 2
	},
};


char			priBuf[120] =
{
	0
};


PollEvent_t 	g_FingerEvent;

//内部函数
void SysTickConfig(void);


/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void DelayUs(uint16_t nCount)
{
	u32 			del = nCount * 5;

	//48M 0.32uS
	//24M 0.68uS
	//16M 1.02us
	while (del--)
		;
}


/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void DelayMs(uint16_t nCount)
{
	unsigned int	ti;

	for (; nCount > 0; nCount--)
	{
		for (ti = 0; ti < 4260; ti++)
			; //16M/980-24M/1420 -48M/2840
	}
}


/*******************************************************************************
* 名称: Strcpy()
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
******************************************************************************/
void Strcpy(u8 * str1, u8 * str2, u8 len)
{
	for (; len > 0; len--)
	{
		*str1++ 			= *str2++;
	}
}


/*******************************************************************************
* 名称: Strcmp()
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
******************************************************************************/
bool Strcmp(u8 * str1, u8 * str2, u8 len)
{
	for (; len > 0; len--)
	{
		if (*str1++ != *str2++)
			return FALSE;
	}

	return TRUE;
}


/*******************************************************************************
* 名称: Sys_DelayMS()
* 功能: 系统延迟函数
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void Sys_DelayMS(uint16_t nms)
{
	mDelay				= nms + 1;

	while (mDelay != 0x0)
		;
}


/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void SysTickConfig(void)
{
	SysTick_CLKSourceConfig(SysTick_CLKSource_HCLK);

	/* Setup SysTick Timer for 1ms interrupts  */
	if (SysTick_Config(SystemCoreClock / 1000))
	{
		/* Capture error */
		while (1)
			;
	}

	/* Configure the SysTick handler priority */
	NVIC_SetPriority(SysTick_IRQn, 0x0);

#if (								SYSINFOR_PRINTF == 1)
	printf("SysTickConfig:Tick=%d/Second\r\n", 1000);
#endif
}


/*******************************************************************************
* 名称: 
* 功能: 校验和
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
u8 CheckSum(u8 * pu8Addr, u8 u8Count)
{
	u8 i				= 0;
	u8 u8Result 		= 0;

	for (i = 0; i < u8Count; i++)
	{
		u8Result			+= pu8Addr[i];
	}

	return ~ u8Result;
}


/*******************************************************************************
* 名称: 
* 功能: 从机包发送
*		包头 + 从机地址 + 	 手表地址 + 命令 + 数据包[3] + 校验和 + 包尾
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void SlavePackageSend(u8 u8SlaveAddr, u8 u8GlassAddr, u8 u8Cmd, u8 * u8Par)
{
	u8 i				= 0;
	u8 u8SendArr[9] 	=
	{
		0
	};

	u8SendArr[0]		= 0xAA; 					//包头
	u8SendArr[1]		= u8SlaveAddr;				//从机地址
	u8SendArr[2]		= u8GlassAddr;				//手表地址
	u8SendArr[3]		= u8Cmd;					//命令
	u8SendArr[4]		= u8Par[0]; 				//参数1
	u8SendArr[5]		= u8Par[1]; 				//参数2
	u8SendArr[6]		= u8Par[2]; 				//参数3

	u8SendArr[7]		= CheckSum(u8SendArr, 7);	//校验和
	u8SendArr[8]		= 0x55; 					//包尾


	for (i = 0; i < 8; i++)
	{
		USART_SendData(USART3, u8SendArr[i]);
	}
}


/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void FingerTouchTask(void)
{
	int retVal			= 0;
	static u8 u8MatchCnt = 0;						//匹配失败次数，默认匹配MATCH_FINGER_CNT次 
	static u8 u8SetCnt	= 0;						//设置失败次数
	int userID			= 0XFFFF;
	FingerData_t * pfingerData;

	switch (SysTask.TouchState)
	{
		case TOUCH_MATCH_INIT:
			if (SysTask.u32TouchWaitTime != 0)
				break;

			if (PS_Sta) //有指纹按下
			{
#if DEBUG
				u3_printf("TOUCH_MATCH_INIT 有按下\n");
#endif

				if (SysTask.LockMode[GLASS_01] == LOCK_ON)
				{
#if DEBUG
					u3_printf("TOUCH_MATCH_INIT 执行关锁\n");
#endif

					SysTask.Stream_State = STREAM_STATE_INIT; //关锁
					SysTask.u32StreamTime = 0;

					SysTask.LockMode[GLASS_01] = LOCK_OFF; //已经开锁，在这可以把锁关了 
					SysTask.u32TouchWaitTime = SysTask.nTick + 3000; //延时一定时间 成功之后防止马上关锁
					break;
				}

				SysTask.u32TouchWaitTime = SysTask.nTick + POWER_ON_DELAY; //一段时间再检测， 让指纹模块MCU上电完全 ,实测1020A需要200ms	1020c 100ms
				FINGER_POWER_ON();					//开启指纹模块电源
				SysTask.TouchState	= TOUCH_MATCH_AGAIN;
				u8MatchCnt			= 0;

