sforganization/20190613/0em/STM32F103_one_angle_module/HARDWARE/COMMENT/SysComment.c
			}

			break;

		case TOUCH_MATCH_AGAIN:
			if (SysTask.u32TouchWaitTime == 0) //有指纹按下
			{
#if 0
				GPIO_SetBits(GPIOC, GPIO_Pin_13);
#endif

				//u8Ensure			= Finger_Search(&userID); //1：N搜索指纹库
				if (g_FingerEvent.bMutex == FALSE)
				{
					g_FingerEvent.bMutex = TRUE;	//上锁，只操作一次
					g_FingerEvent.MachineCtrl.u32Timeout = FINGER_REV_TIME_OUT; //1S 超时  ,5次就是6S
					g_FingerEvent.MachineRun.u32StartTime = SysTask.u32SysTimes;
					g_FingerEvent.MachineRun.bFinish = FALSE;
					g_FingerEvent.MachineCtrl.CallBack(FINGER_SEARCHING, &g_FingerEvent);
				}
				else 
				{
					g_FingerEvent.MachineRun.u32LastTime = SysTask.u32SysTimes;
					g_FingerEvent.MachineCtrl.CallBack(FINGER_SEARCHING, &g_FingerEvent);
				}

				if (g_FingerEvent.MachineRun.bFinish == TRUE)
				{
					if (g_FingerEvent.MachineRun.u16RetVal == EVENT_TIME_OUT) //超时退出
					{
#if DEBUG
						u3_printf("超时退出。。。。。\n");
#endif
					}

					pfingerData 		= ((FingerData_t *) g_FingerEvent.MachineCtrl.pData);
					userID				= pfingerData->u8FingerID;
					g_FingerEvent.bMutex = FALSE;
				}
				else 
				{
					break;
				}


#if 0
				GPIO_ResetBits(GPIOC, GPIO_Pin_13);
#endif

				if (g_FingerEvent.MachineRun.u16RetVal == TRUE) //匹配成功
				{
					pfingerData 		= ((FingerData_t *) g_FingerEvent.MachineCtrl.pData);
					userID				= pfingerData->u8FingerID;

#if DEBUG
					u3_printf("TOUCH_MATCH_AGAIN 匹配成功，lock开锁 ID %d\n", userID);
#endif

					SysTask.Stream_State = STREAM_STATE_OPEN_LOCK; //开锁，全亮

					//SysTask.u16FingerfCnt = seach.pageID;
					SysTask.u32TouchWaitTime = SysTask.nTick + 3000; //延时一定时间 成功之后防止马上关锁
					SysTask.TouchSub	= TOUCH_SUB_INIT;
					SysTask.TouchState	= TOUCH_MATCH_INIT; //重新匹配
					SysTask.LockMode[GLASS_01] = LOCK_ON; //匹配成功，可以开锁

					FINGER_POWER_OFF(); 			//关闭指纹模块电源
				}
				else 
				{
#if DEBUG
					u3_printf("TOUCH_MATCH_AGAIN 匹配失败\n");
#endif

					SysTask.u32TouchWaitTime = SysTask.nTick + 100; //延时一定时间 如果手臭识别不了，再想来一个人检测，

					//匹配失败
					if (u8MatchCnt++ >= MATCH_FINGER_CNT) // 50 * 3 大约200MS秒
					{
						SysTask.Stream_State = STREAM_STATE_FAILED; //灯闪烁提示
						SysTask.u8StreamShoWCnt = BLINK_CNT_8;
						FINGER_POWER_OFF(); 		//关闭指纹模块电源
						SysTask.TouchState	= TOUCH_MATCH_INIT; //重新匹配
						SysTask.u32TouchWaitTime = SysTask.nTick + 500; //延时一定时间 如果手臭识别不了，再想来一个人检测，
					}
				}
			}

			break;

		case TOUCH_ADD_USER:
			{
				switch (SysTask.TouchSub)
				{
					case TOUCH_SUB_INIT: // *
						if (SysTask.u16FingerfCnt > FINGER_ID_MAX - 2) //因为一个指纹要录入两次（有抬手再按下去的动作） ，所以要减去2
						{
#if DEBUG
							u3_printf("TOUCH_ADD_USER ");
							snprintf(priBuf, 50, "SysTask.u16FingerfCnt : %d\n", SysTask.u16FingerfCnt);
							u3_printf(priBuf);
							u3_printf("\n");
							u3_printf("用户已满\n");
#endif

							SysTask.Stream_State = STREAM_STATE_FAILED; //灯闪烁提示
							SysTask.u8StreamShoWCnt = BLINK_CNT_8;

							SysTask.TouchState	= TOUCH_MATCH_INIT; //重新匹配
							SysTask.u32TouchWaitTime = SysTask.nTick + POWER_ON_DELAY; //延时一定时间
							return;
						}
						else if ((PS_Sta) && (SysTask.u32TouchWaitTime == 0))
						{
#if DEBUG
							u3_printf("TOUCH_ADD_USER ");
							snprintf(priBuf, 50, "SysTask.u16FingerfCnt : %d\n", SysTask.u16FingerfCnt);
							u3_printf(priBuf);
							u3_printf("开启指纹模块电源-->添加\n");
#endif

							FINGER_POWER_ON();		//开启指纹模块电源
							SysTask.u32TouchWaitTime = POWER_ON_DELAY; //延时一定时间再去设置重复模式
							u8MatchCnt			= 0;
							SysTask.u16FingerfCnt++;
							SysTask.TouchSub	= TOUCH_SUB_SETMODE_ONE;
							u8SetCnt			= 0;
							SysTask.Stream_State = STREAM_STATE_BLINK_TWO; //
						}

						break;

					case TOUCH_SUB_SETMODE_ONE: // *
						if (SysTask.u32TouchWaitTime == 0)
						{
							if (g_FingerEvent.bMutex == FALSE)
							{
								g_FingerEvent.bMutex = TRUE; //上锁，只操作一次
								g_FingerEvent.MachineCtrl.u32Timeout = FINGER_REV_TIME_OUT; //1S 超时  ,5次就是6S
								g_FingerEvent.MachineRun.u32StartTime = SysTask.u32SysTimes;
								g_FingerEvent.MachineRun.bFinish = FALSE;
								g_FingerEvent.MachineCtrl.CallBack(FINGER_MODE_SET, &g_FingerEvent);
							}
							else 
							{
								g_FingerEvent.MachineRun.u32LastTime = SysTask.u32SysTimes;
								g_FingerEvent.MachineCtrl.CallBack(FINGER_MODE_SET, &g_FingerEvent);
							}

							if (g_FingerEvent.MachineRun.bFinish == TRUE)
							{
								if (g_FingerEvent.MachineRun.u16RetVal == EVENT_TIME_OUT) //超时退出
								{
#if DEBUG
									u3_printf("超时退出。。。。。\n");
#endif
								}

								g_FingerEvent.bMutex = FALSE;
							}
							else 
							{
								break;				//等待下层上传的结果状态
							}

							u8SetCnt++;

							//if (!Finger_ModeSet())
							if (g_FingerEvent.MachineRun.u16RetVal == TRUE)
							{
#if DEBUG
								u3_printf("设置重复模式成功\n");
								snprintf(priBuf, 10, "CNT : %d\n", u8SetCnt);
								u3_printf(priBuf);
								u3_printf("\n");
#endif

#if DEBUG
								u3_printf("第一，采集指纹\n");
#endif

								SysTask.TouchSub	= TOUCH_SUB_ENTER;
							}
							else 
							{
#if DEBUG
								u3_printf("设置重复模式失败\n");
#endif

								if (u8SetCnt <= 5)
									SysTask.u32TouchWaitTime = 100;
								else 
									SysTask.TouchSub = TOUCH_SUB_ENTER;
							}
						}

						break;

					case TOUCH_SUB_ENTER: //
						if ((SysTask.u32TouchWaitTime == 0)) //时间到去采集
						{
							if (g_FingerEvent.bMutex == FALSE)
							{
								SysTask.Stream_State = STREAM_STATE_BLINK_TWO; //
								g_FingerEvent.bMutex = TRUE; //上锁，只操作一次
								g_FingerEvent.MachineCtrl.u32Timeout = FINGER_REV_TIME_OUT * 5; //1S 超时  ,5次就是6S
								g_FingerEvent.MachineRun.u32StartTime = SysTask.u32SysTimes;
								g_FingerEvent.MachineRun.bFinish = FALSE;
								pfingerData 		= ((FingerData_t *) g_FingerEvent.MachineCtrl.pData);
								pfingerData->u8FingerID = SysTask.u16FingerfCnt;
								g_FingerEvent.MachineCtrl.CallBack(FINGER_ENROLL, &g_FingerEvent);
							}
							else 
							{
								pfingerData 		= ((FingerData_t *) g_FingerEvent.MachineCtrl.pData);
								pfingerData->u8FingerID = SysTask.u16FingerfCnt;
								g_FingerEvent.MachineRun.u32LastTime = SysTask.u32SysTimes;
								g_FingerEvent.MachineCtrl.CallBack(FINGER_ENROLL, &g_FingerEvent);
							}

