sforganization/20190613/0em/STM32F103_one_angle_module/HARDWARE/COMMENT/SysComment.c
							if (g_FingerEvent.MachineRun.bFinish == TRUE)
							{
								if (g_FingerEvent.MachineRun.u16RetVal == EVENT_TIME_OUT) //超时退出
								{
#if DEBUG
									u3_printf("超时退出。。。。。\n");
#endif
								}

								pfingerData 		= ((FingerData_t *) g_FingerEvent.MachineCtrl.pData);
								userID				= pfingerData->u8FingerID;
								g_FingerEvent.bMutex = FALSE;
							}
							else 
							{
								break;				//等待下层上传的结果状态
							}

							//u8Ensure			= Finger_Enroll(SysTask.u16FingerfCnt);
							if (g_FingerEvent.MachineRun.u16RetVal == TRUE)
							{
#if DEBUG
								u3_printf("第一，采集指纹成功\n");
#endif

								SysTask.Stream_State = STREAM_STATE_BLINK_THREE; //

								u8MatchCnt			= 0;
								SysTask.u32TouchWaitTime = 300; //延时一定时间再去采集
								SysTask.TouchSub	= TOUCH_SUB_AGAIN_PON; //跳到第二步		
								FINGER_POWER_OFF(); //关闭指纹模块电源,等待录入第二次指纹		
							}
							else 
							{

								if (u8MatchCnt++ >= MATCH_FINGER_CNT) // 50 * 3 大约200MS秒
								{
#if DEBUG
									u3_printf("第一，采集指纹失败，超过最大次数，退出添加\n");
#endif

									SysTask.Stream_State = STREAM_STATE_FAILED; //灯闪烁提示
									SysTask.u8StreamShoWCnt = BLINK_CNT_8;

									SysTask.u16FingerfCnt -= 1;
									FINGER_POWER_OFF(); //关闭指纹模块电源

									SysTask.TouchState	= TOUCH_MATCH_INIT; //重新匹配		
									SysTask.TouchSub	= TOUCH_SUB_INIT;
								}
								else 
								{
#if DEBUG
									u3_printf("第一，采集指纹失败 ");
									snprintf(priBuf, 10, "CNT : %d\n", u8MatchCnt);
									u3_printf(priBuf);
									u3_printf("\n");
#endif

									//匹配失败这里要进行一定的提示操作
									SysTask.u32TouchWaitTime = 100; //延时一定时间再次添加
								}
							}
						}

						break;

					case TOUCH_SUB_AGAIN_PON:
						if ((PS_Sta) && (SysTask.u32TouchWaitTime == 0))
						{
							FINGER_POWER_ON();		//开启指纹模块电源
							SysTask.u32TouchWaitTime = POWER_ON_DELAY; //延时一定时间再去采集
							u8MatchCnt			= 0;
							SysTask.u16FingerfCnt++;
							SysTask.TouchSub	= TOUCH_SUB_SETMODE_TWO;
							u8SetCnt			= 0;
						}

						break;

					case TOUCH_SUB_SETMODE_TWO: // *
						if (SysTask.u32TouchWaitTime == 0)
						{

							if (g_FingerEvent.bMutex == FALSE)
							{
								g_FingerEvent.bMutex = TRUE; //上锁，只操作一次
								g_FingerEvent.MachineCtrl.u32Timeout = FINGER_REV_TIME_OUT; //1S 超时  ,5次就是6S
								g_FingerEvent.MachineRun.u32StartTime = SysTask.u32SysTimes;
								g_FingerEvent.MachineRun.bFinish = FALSE;
								g_FingerEvent.MachineCtrl.CallBack(FINGER_MODE_SET, &g_FingerEvent);
							}
							else 
							{
								g_FingerEvent.MachineRun.u32LastTime = SysTask.u32SysTimes;
								g_FingerEvent.MachineCtrl.CallBack(FINGER_MODE_SET, &g_FingerEvent);
							}

							if (g_FingerEvent.MachineRun.bFinish == TRUE)
							{
								if (g_FingerEvent.MachineRun.u16RetVal == EVENT_TIME_OUT) //超时退出
								{
#if DEBUG
									u3_printf("超时退出。。。。。\n");
#endif
								}

								g_FingerEvent.bMutex = FALSE;
							}
							else 
							{
								break;				//等待下层上传的结果状态
							}

							u8SetCnt++;

							if (!g_FingerEvent.MachineRun.u16RetVal)
							{
#if DEBUG
								u3_printf("2. 设置重复模式成功\n");
								snprintf(priBuf, 10, "CNT : %d\n", u8SetCnt);
								u3_printf(priBuf);
								u3_printf("\n");
#endif

								SysTask.TouchSub	= TOUCH_SUB_AGAIN;
							}
							else 
							{
								if (u8SetCnt <= 8)
									SysTask.u32TouchWaitTime = 50;
								else 
									SysTask.TouchSub = TOUCH_SUB_AGAIN;
							}
						}

						break;

					case TOUCH_SUB_AGAIN:
						if ((SysTask.u32TouchWaitTime == 0)) //
						{
							if (g_FingerEvent.bMutex == FALSE)
							{
								g_FingerEvent.bMutex = TRUE; //上锁，只操作一次
								g_FingerEvent.MachineCtrl.u32Timeout = FINGER_REV_TIME_OUT * 5; //1S 超时  ,5次就是6S
								g_FingerEvent.MachineRun.u32StartTime = SysTask.u32SysTimes;
								g_FingerEvent.MachineRun.bFinish = FALSE;
								pfingerData 		= ((FingerData_t *) g_FingerEvent.MachineCtrl.pData);
								pfingerData->u8FingerID = SysTask.u16FingerfCnt;
								g_FingerEvent.MachineCtrl.CallBack(FINGER_ENROLL, &g_FingerEvent);
							}
							else 
							{
								pfingerData 		= ((FingerData_t *) g_FingerEvent.MachineCtrl.pData);
								pfingerData->u8FingerID = SysTask.u16FingerfCnt;
								g_FingerEvent.MachineRun.u32LastTime = SysTask.u32SysTimes;
								g_FingerEvent.MachineCtrl.CallBack(FINGER_ENROLL, &g_FingerEvent);
							}

							if (g_FingerEvent.MachineRun.bFinish == TRUE)
							{
								if (g_FingerEvent.MachineRun.u16RetVal == EVENT_TIME_OUT) //超时退出
								{
#if DEBUG
									u3_printf("超时退出。。。。。\n");
#endif
								}

								pfingerData 		= ((FingerData_t *) g_FingerEvent.MachineCtrl.pData);
								userID				= pfingerData->u8FingerID;
								g_FingerEvent.bMutex = FALSE;
							}
							else 
							{
								break;				//等待下层上传的结果状态
							}

							//							u8Ensure			= Finger_Enroll(SysTask.u16FingerfCnt); //存入另外一个ID中，一个指纹一共存两个，，，注意，这里的指纹不一定是同一个
							if (g_FingerEvent.MachineRun.u16RetVal == TRUE)
							{
#if DEBUG
								u3_printf("第二，采集指纹成功\n");
#endif

								SysTask.Stream_State = STREAM_STATE_SUCCESS; //

								SysTask.u16SaveTick = 1; //1秒后保存
								SysTask.TouchSub	= TOUCH_SUB_WAIT;
								SysTask.u32TouchWaitTime = 300; //延时一定时间退出
							}
							else 
							{
								//采集指纹失败
								if (u8MatchCnt++ >= MATCH_FINGER_CNT) // 50 * 3 大约200MS秒
								{
#if DEBUG
									u3_printf("采集指纹失败超过次数\n");
									u3_printf("删除第一次保存的，退出添加\n");
#endif

									SysTask.Stream_State = STREAM_STATE_FAILED; //灯闪烁提示
									SysTask.u8StreamShoWCnt = BLINK_CNT_8;

									Finger_Delete(SysTask.u16FingerfCnt - 1); //添加失败，删除第一个录入的
									SysTask.u16FingerfCnt -= 2;
									FINGER_POWER_OFF(); //关闭指纹模块电源

									SysTask.TouchState	= TOUCH_MATCH_INIT; //重新匹配		
									SysTask.TouchSub	= TOUCH_SUB_INIT;
								}
								else 
								{
#if DEBUG
									u3_printf("采集指纹失败，重新采集\n");
#endif

									//匹配失败这里要进行一定的提示操作
									//SysTask.TouchSub	= TOUCH_SUB_ENTER;	 //重复模式这里不用再次搞
									SysTask.u32TouchWaitTime = 60; //延时一定时间再次添加
								}
							}
						}

						break;

					case TOUCH_SUB_WAIT: // *
						if ((SysTask.u32TouchWaitTime == 0))
						{
							FINGER_POWER_OFF(); 	//关闭指纹模块电源

							SysTask.TouchState	= TOUCH_MATCH_INIT; //重新匹配		
							SysTask.TouchSub	= TOUCH_SUB_INIT;
						}

						break;

					default:
						break;
				}
			}
			break;

		case TOUCH_DEL_USER:
			{
				switch (SysTask.TouchSub)
				{
					case TOUCH_SUB_INIT: // *
						if (SysTask.u32TouchWaitTime == 0)
						{
							FINGER_POWER_ON();		//开启指纹模块电源
							u8MatchCnt			= 0;
							SysTask.TouchSub	= TOUCH_SUB_ENTER;
							SysTask.u32TouchWaitTime = POWER_ON_DELAY; //
						}

						break;

					case TOUCH_SUB_ENTER: //
						if (SysTask.u32TouchWaitTime)
						{
							break;
						}

						if (g_FingerEvent.bMutex == FALSE)
						{
							g_FingerEvent.bMutex = TRUE; //上锁，只操作一次
							g_FingerEvent.MachineCtrl.u32Timeout = FINGER_REV_TIME_OUT * 5; //1S 超时  ,5次就是6S
							g_FingerEvent.MachineRun.u32StartTime = SysTask.u32SysTimes;
							g_FingerEvent.MachineRun.bFinish = FALSE;
							pfingerData 		= ((FingerData_t *) g_FingerEvent.MachineCtrl.pData);
							pfingerData->u8FingerID = SysTask.u16FingerfCnt;
							g_FingerEvent.MachineCtrl.CallBack(FINGER_CLEAR, &g_FingerEvent);
						}
						else 
						{
							pfingerData 		= ((FingerData_t *) g_FingerEvent.MachineCtrl.pData);
							pfingerData->u8FingerID = SysTask.u16FingerfCnt;
							g_FingerEvent.MachineRun.u32LastTime = SysTask.u32SysTimes;
							g_FingerEvent.MachineCtrl.CallBack(FINGER_CLEAR, &g_FingerEvent);
						}

