sforganization/20190613/0em/STM32F103_one_angle_module/HARDWARE/COMMENT/SysComment.c
						if (g_FingerEvent.MachineRun.bFinish == TRUE)
						{
							if (g_FingerEvent.MachineRun.u16RetVal == EVENT_TIME_OUT) //超时退出
							{
#if DEBUG
								u3_printf("超时退出。。。。。\n");
#endif
							}

							pfingerData 		= ((FingerData_t *) g_FingerEvent.MachineCtrl.pData);
							userID				= pfingerData->u8FingerID;
							g_FingerEvent.bMutex = FALSE;
						}
						else 
						{
							break;					//等待下层上传的结果状态
						}

						//u8Ensure = Finger_Clear(); //删除整个指纹库
						if (g_FingerEvent.MachineRun.u16RetVal == TRUE)
						{
#if DEBUG
							u3_printf("删除整个指纹库，成功\n");
#endif

							SysTask.Stream_State = STREAM_STATE_SUCCESS; //

							SysTask.u16FingerfCnt = 0;
							SysTask.u16SaveTick = 1; //1秒后保存
							SysTask.TouchSub	= TOUCH_SUB_WAIT;
							SysTask.u32TouchWaitTime = 100; //延时一定时间退出
						}
						else //删除失败 ,
						{
							u8MatchCnt++;
							SysTask.u32TouchWaitTime = 100; //延时一定时间再次删除

							if (u8MatchCnt >= 3) //失败退出
							{
#if DEBUG
								u3_printf("删除整个指纹库， 失败\n");
#endif

								SysTask.Stream_State = STREAM_STATE_FAILED; //灯闪烁提示
								SysTask.u8StreamShoWCnt = BLINK_CNT_8;

								SysTask.TouchSub	= TOUCH_SUB_WAIT;
							}
						}

						break;

					case TOUCH_SUB_WAIT: // *
						if ((SysTask.u32TouchWaitTime == 0))
						{
							FINGER_POWER_OFF(); 	//关闭指纹模块电源
							SysTask.TouchState	= TOUCH_MATCH_INIT; //重新匹配		
							SysTask.TouchSub	= TOUCH_SUB_INIT;
						}

						break;

					default:
						break;
				}
			}
			break;

		case TOUCH_KEY_SHORT: //短按
			//短按，添加指纹
			//如果指纹模块里面还没有保存用户，则保存为ROOT用户
			//如果已经保存有指纹，则用ROOT用户验证成功之后，才可以添加用户（ROOT用户为第一个添加的用户）
			switch (SysTask.TouchSub)
			{
				case TOUCH_SUB_INIT: // 
					if (SysTask.u16FingerfCnt == 0) //当前还没有保存有用户。直接添加
					{
#if DEBUG
						u3_printf("TOUCH_KEY_SHORT 没有ROOT用户，直接添加为ROOT\n");
#endif
						SysTask.u32TouchWaitTime = 6000; //超时退出

						SysTask.TouchState	= TOUCH_ADD_USER;
					}
					else 
					{
#if DEBUG
						snprintf(priBuf, 50, "SysTask.u16FingerfCnt : %d\n", SysTask.u16FingerfCnt);
						u3_printf(priBuf);
						u3_printf("已经有ROOT，确认ROOT\n");
#endif

						SysTask.Stream_State = STREAM_STATE_BLINK_ONE; //

						SysTask.TouchSub	= TOUCH_SUB_CHECK_ROOT;
						SysTask.u32TouchWaitTime = 6000; //超时退出
						u8MatchCnt			= 0;
					}

					break;

				case TOUCH_SUB_CHECK_ROOT: // 确认ROOT用户 
					if (PS_Sta) //有指纹按下
					{
#if DEBUG
						u3_printf("TOUCH_SUB_AGAIN 有按下\n");
#endif

						SysTask.u32TouchWaitTime = SysTask.nTick + POWER_ON_DELAY; //一段时间再检测， 让指纹模块MCU上电完全 ,实测1020A需要200ms	1020c 100ms
						FINGER_POWER_ON();			//开启指纹模块电源
						SysTask.TouchSub	= TOUCH_SUB_AGAIN;
					}
					else if (SysTask.u32TouchWaitTime == 0)
					{
						//超时退出
#if DEBUG
						u3_printf("没有识别到ROOT 超时退出 \n");
#endif
						SysTask.TouchState	= TOUCH_MATCH_INIT; //重新匹配
						SysTask.TouchSub	= TOUCH_SUB_INIT;
						SysTask.Stream_State = STREAM_STATE_FAILED; //灯闪烁提示
						SysTask.u8StreamShoWCnt = BLINK_CNT_6;
					}

					break;

				case TOUCH_SUB_AGAIN:
					if (SysTask.u32TouchWaitTime == 0) //有指纹按下
					{
						if (g_FingerEvent.bMutex == FALSE)
						{
							g_FingerEvent.bMutex = TRUE; //上锁，只操作一次
							g_FingerEvent.MachineCtrl.u32Timeout = FINGER_REV_TIME_OUT; //1S 超时  ,5次就是6S
							g_FingerEvent.MachineRun.u32StartTime = SysTask.u32SysTimes;
							g_FingerEvent.MachineRun.bFinish = FALSE;
							g_FingerEvent.MachineCtrl.CallBack(FINGER_SEARCHING, &g_FingerEvent);
						}
						else 
						{
							g_FingerEvent.MachineRun.u32LastTime = SysTask.u32SysTimes;
							g_FingerEvent.MachineCtrl.CallBack(FINGER_SEARCHING, &g_FingerEvent);
						}

						if (g_FingerEvent.MachineRun.bFinish == TRUE)
						{
							if (g_FingerEvent.MachineRun.u16RetVal == EVENT_TIME_OUT) //超时退出
							{
#if DEBUG
								u3_printf("超时退出。。。。。\n");
#endif
							}

							pfingerData 		= ((FingerData_t *) g_FingerEvent.MachineCtrl.pData);
							userID				= pfingerData->u8FingerID;
							g_FingerEvent.bMutex = FALSE;
						}
						else 
						{
							break;
						}

						//		u8Ensure			= Finger_Search(&userID); //1：N搜索指纹库
						if (g_FingerEvent.MachineRun.u16RetVal == TRUE) //匹配成功
						{

							pfingerData 		= ((FingerData_t *) g_FingerEvent.MachineCtrl.pData);
							userID				= pfingerData->u8FingerID;

							if ((userID != ROOT_ID_NUM_1) && (userID != ROOT_ID_NUM_2))
							{ //非ROOT用户

#if DEBUG
								u3_printf("TOUCH_MATCH_AGAIN 匹配失败	非ROOT用户");
								snprintf(priBuf, 50, "userID : %d\n", userID);
								u3_printf(priBuf);
								u3_printf("\n");
#endif

								SysTask.u32TouchWaitTime = SysTask.nTick + 100; //延时一定时间 再次试试

								//匹配失败
								if (u8MatchCnt++ >= MATCH_FINGER_CNT) // 50 * 3 大约200MS秒
								{

#if DEBUG
									u3_printf("TOUCH_MATCH_AGAIN 匹配失败超次，退出 \n");
#endif

									SysTask.Stream_State = STREAM_STATE_FAILED; //灯闪烁提示
									SysTask.u8StreamShoWCnt = BLINK_CNT_8;

									FINGER_POWER_OFF(); //关闭指纹模块电源
									SysTask.TouchState	= TOUCH_MATCH_INIT; //重新匹配
									SysTask.u32TouchWaitTime = SysTask.nTick + 500; //延时一定时间 
								}
							}
							else 
							{
#if DEBUG
								u3_printf("确认为ROOT，添加指纹\n");
#endif

								FINGER_POWER_OFF(); //先关闭指纹模块电源，不然识别不到有 touch电平变化 
                                
                                SysTask.Stream_State = STREAM_STATE_BLINK_TWO; //灯闪烁提示

								SysTask.TouchState	= TOUCH_ADD_USER;
								SysTask.TouchSub	= TOUCH_SUB_INIT;
								SysTask.u32TouchWaitTime = 0;
							}
						}
						else 
						{
#if DEBUG
							u3_printf("TOUCH_MATCH_AGAIN 匹配失败\n");
#endif

							SysTask.u32TouchWaitTime = SysTask.nTick + 100; //延时一定时间 如果手臭识别不了，再想来一个人检测，

							//匹配失败
							if (u8MatchCnt++ >= MATCH_FINGER_CNT) // 50 * 3 大约200MS秒
							{
#if DEBUG
								u3_printf("TOUCH_MATCH_AGAIN 匹配失败超次，退出 \n");
#endif
                                
                                SysTask.Stream_State = STREAM_STATE_FAILED; //灯闪烁提示
                                SysTask.u8StreamShoWCnt = BLINK_CNT_8;

								FINGER_POWER_OFF(); //关闭指纹模块电源
								SysTask.TouchState	= TOUCH_MATCH_INIT; //重新匹配
								SysTask.TouchSub	= TOUCH_SUB_INIT;
								SysTask.u32TouchWaitTime = SysTask.nTick + 500; //延时一定时间 如果手臭识别不了，再想来一个人检测，
							}
						}
					}

					break;

				default:
					break;
			}

			break;

		case TOUCH_CHECK: //读取ID看与EEPROM是否一致, 设置指纹的录入模式为可重复
			if (SysTask.u32TouchWaitTime)
				return;

			switch (SysTask.TouchSub)
			{
				case TOUCH_SUB_INIT: // *
					//					if (SysTask.u32TouchWaitTime == 0)
					//					{
					//						u8SetCnt++;
					//						if (!Finger_ModeSet())
					//						{
					//#if DEBUG
					//							u3_printf("TOUCH_CHECK 成功");
					//#endif
					//							SysTask.TouchSub	= TOUCH_SUB_ENTER;
					//						}
					//						else 
					//						{
					//							SysTask.u32TouchWaitTime = 50;
					//							SysTask.TouchSub	= TOUCH_SUB_WAIT; //失败重新设置进去
					//						}
					//					}
					//每一次添加前才用设置可重复添加模式
					SysTask.u32TouchWaitTime = 5;
					SysTask.TouchSub = TOUCH_SUB_ENTER;
					break;

				case TOUCH_SUB_ENTER: //
					if (SysTask.u32TouchWaitTime)
					{
						break;
					}

					if (g_FingerEvent.bMutex == FALSE)
					{
						g_FingerEvent.bMutex = TRUE; //上锁，只操作一次
						g_FingerEvent.MachineCtrl.u32Timeout = FINGER_REV_TIME_OUT; //1S 超时  ,5次就是6S
						g_FingerEvent.MachineRun.u32StartTime = SysTask.u32SysTimes;
						g_FingerEvent.MachineRun.bFinish = FALSE;
						g_FingerEvent.MachineCtrl.CallBack(FINGER_READ, &g_FingerEvent);
					}
					else 
					{
						g_FingerEvent.MachineRun.u32LastTime = SysTask.u32SysTimes;
						g_FingerEvent.MachineCtrl.CallBack(FINGER_READ, &g_FingerEvent);
					}

