sforganization/20190613/0em/STM32F103_one_angle_module/HARDWARE/COMMENT/SysComment.c
					if (g_FingerEvent.MachineRun.bFinish == TRUE)
					{
						if (g_FingerEvent.MachineRun.u16RetVal == EVENT_TIME_OUT) //超时退出
						{
#if DEBUG
							u3_printf("超时退出。。。。。\n");
#endif
						}

						g_FingerEvent.bMutex = FALSE;
					}
					else 
					{
						break;						//等待下层上传的结果状态
					}

					//retVal = Finger_Read();
					pfingerData = ((FingerData_t *) g_FingerEvent.MachineCtrl.pData);
					retVal = pfingerData->u8FingerID;

					if (retVal != -1)
					{
#if DEBUG
						snprintf(priBuf, 50, "SysTask.u16FingerfCnt : %d	 read cnt:	%d\n", SysTask.u16FingerfCnt, retVal);
						u3_printf(priBuf);
						u3_printf("\n");
#endif

						SysTask.TouchSub	= TOUCH_SUB_EXIT;

						if (((unsigned int) retVal) != SysTask.u16FingerfCnt)
						{
#if DEBUG
							u3_printf("保存的与读取的不匹配\n");
#endif

							SysTask.Stream_State = STREAM_STATE_FAILED; //灯闪烁提示
							SysTask.u8StreamShoWCnt = BLINK_CNT_8;

							if ((retVal <= FINGER_ID_MAX) && (retVal & 0x01 == 0)) //因为1020A 保存一个用户占用两个ID
							{

#if DEBUG
								u3_printf("保存新值 ");
								snprintf(priBuf, 50, "SysTask.u16FingerfCnt : %d\n", SysTask.u16FingerfCnt);
								u3_printf(priBuf);
								u3_printf("\n");
#endif

								SysTask.u16FingerfCnt = retVal;
								SysTask.u16SaveTick = 1; //1秒后保存
							}
							else 
							{
#if DEBUG
								u3_printf("全部清空\n");
#endif

								//TODO	要不要删除上面的指纹信息
								SysTask.TouchState	= TOUCH_DEL_USER;
								SysTask.TouchSub	= TOUCH_SUB_INIT;

								SysTask.u16FingerfCnt = 0;
								SysTask.u16SaveTick = 1; //1秒后保存
							}
						}
					}

					break;

				case TOUCH_SUB_WAIT: // *
					if ((SysTask.u32TouchWaitTime == 0))
					{
						if (u8SetCnt >= 20) //设置20次失败，则返回
							SysTask.TouchSub = TOUCH_SUB_ENTER;
						else 
							SysTask.TouchSub = TOUCH_SUB_INIT;
					}

					break;

				case TOUCH_SUB_EXIT: // *
					if ((SysTask.u32TouchWaitTime == 0))
					{
						FINGER_POWER_OFF(); 		//关闭指纹模块电源
						SysTask.TouchState	= TOUCH_MATCH_INIT; //重新匹配	 
						SysTask.TouchSub	= TOUCH_SUB_INIT;
						u8SetCnt			= 0;
					}

					break;

				default:
					break;
			}

			break;

		default:
			break;
	}
}




/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void LedTask(void)
{
	  if (SysTask.LockMode[GLASS_01] != SysTask.LockModeSave[GLASS_01])
	  {
		  if (SysTask.LockMode[GLASS_01] == LOCK_ON) //将要开锁
		  {
			  GPIO_SetBits(LED_GPIO, LED_PIN_SINGLE);
		  }
		  else //将要关锁
		  {
			  GPIO_ResetBits(LED_GPIO, LED_PIN_SINGLE);
		  }
		  
		SysTask.LockModeSave[GLASS_01] = SysTask.LockMode[GLASS_01];
	  }
}


/*******************************************************************************
* 名称: 
* 功能: 流水灯
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void LedStreamTask(void)
{
	static u8 u8LedNum	= 0;

	static u8 u8Blink	= 0;

	//流水灯效果
	switch (SysTask.Stream_State)
	{
		case STREAM_STATE_INIT:
			if (SysTask.u32StreamTime != 0)
				break;

			ws2812bClearAll();
			u8LedNum = 0;
			u8Blink = 0;

			if (SysTask.LockMode[GLASS_01] == LOCK_ON) //开锁在开锁状态
			{
				SysTask.Stream_State = STREAM_STATE_OPEN_LOCK;
			}
			else //关锁
			{
				SysTask.Stream_State = STREAM_STATE_STREAM;
			}

			break;

		case STREAM_STATE_STREAM: //流水
			if (SysTask.u32StreamTime != 0)
				break;

			SysTask.u32StreamTime = STREAM_TIME;

			if (u8LedNum > WS2812B_NUM)
			{
				ws2812bClearAll();
				u8LedNum			= 0;
				break;
			}
			else 
			{
				ws2812bSet(u8LedNum, LED_BRIGHNESS); //0X60 亮度，可调
			}

			u8LedNum++;
			break;

		case STREAM_STATE_OPEN_LOCK:
			if (SysTask.u32StreamTime != 0)
				break;

			ws2812bSetAll(LED_BRIGHNESS); //开锁时全亮，关锁再去关闭
			SysTask.u32StreamTime = (vu32) - 1;
			break;

		case STREAM_STATE_BLINK_ONE: //闪烁第一个灯
			if (SysTask.u32StreamTime != 0)
				break;

			SysTask.u32StreamTime = BLINK_TIME;

			if (u8Blink)
			{
				ws2812bSet(0, LED_BRIGHNESS);		//0X60 亮度，可调
				u8Blink 			= 0;
			}
			else 
			{
				u8Blink 			= 1;
				ws2812bClearAll();
			}

			break;

		case STREAM_STATE_BLINK_TWO: //闪烁第二个灯
			if (SysTask.u32StreamTime != 0)
				break;

			SysTask.u32StreamTime = BLINK_TIME;

			if (u8Blink)
			{
				ws2812bClearAll();
				ws2812bSet(0, LED_BRIGHNESS);		//0X60 亮度，可调 
				ws2812bSet(1, LED_BRIGHNESS);		//0X60 亮度，可调 
				u8Blink 			= 0;
			}
			else 
			{
				u8Blink 			= 1;
				ws2812bClear(1);
			}

			break;

		case STREAM_STATE_BLINK_THREE: //闪烁第三个灯
			if (SysTask.u32StreamTime != 0)
				break;

			SysTask.u32StreamTime = BLINK_TIME;

			if (u8Blink)
			{
				ws2812bClearAll();
				ws2812bSet(0, LED_BRIGHNESS);		//0X60 亮度，可调 
				ws2812bSet(1, LED_BRIGHNESS);		//0X60 亮度，可调 
				ws2812bSet(2, LED_BRIGHNESS);		//0X60 亮度，可调 
				u8Blink 			= 0;
			}
			else 
			{
				u8Blink 			= 1;
				ws2812bClear(2);
			}

			break;

		case STREAM_STATE_SUCCESS: //成功匹配
			if (SysTask.u32StreamTime != 0)
				break;

			SysTask.u32StreamTime = 2000; //亮2S 表示成功，再进入流水
			SysTask.Stream_State = STREAM_STATE_INIT;
			ws2812bSetAll(LED_BRIGHNESS);
			break;

		case STREAM_STATE_FAILED: //失败
			if (SysTask.u32StreamTime != 0)
				break;

			if (SysTask.u8StreamShoWCnt == 0) //闪烁完成，进入正常的流水状态
			{
				u8LedNum			= 0;
				u8Blink 			= 0;
				SysTask.Stream_State = STREAM_STATE_INIT;
				SysTask.u32StreamTime = 500;
				break;
			}

			SysTask.u32StreamTime = FAILED_TIME;

			if (SysTask.u8StreamShoWCnt & 0x01)
			{
				ws2812bClearAll();
			}
		else 
			{
				ws2812bSetAll(LED_BRIGHNESS);
			}

			SysTask.u8StreamShoWCnt--;
			break;

		default:
			break;
	}
}


/*******************************************************************************
* 名称: 
* 功能: SOFT PWM 控制电机转动
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void PWM_01_Task(void)
{
	static u8 u8StateSave = PWM_STATE_INIT;

	if (SysTask.PWM_State[GLASS_01] == u8StateSave)
		return;

	//A电机
	switch (SysTask.PWM_State[GLASS_01])
	{
		case PWM_STATE_INIT:
			break;

		case PWM_STATE_FEW_P:
			TIM_SetCompare3(TIM3, PWM_POSITIVE); //修改PWM占空比 ,正转
			TIM_SetCompare4(TIM3, 0); //

			//TIM3->CCR4=0;
			TIM_CtrlPWMOutputs(TIM3, ENABLE); // 使能输出PWM
			break;

		case PWM_STATE_REV_P:
			TIM_SetCompare4(TIM3, PWM_POSITIVE); //修改PWM占空比, 反转
			TIM_SetCompare3(TIM3, 0); //

			//TIM3->CCR3=0;
			TIM_CtrlPWMOutputs(TIM3, ENABLE); // 使能输出PWM
			break;

