sforganization/20190613/0em/STM32F103_one_angle_module/HARDWARE/COMMENT/SysComment.c
		case PWM_STATE_OPEN: //开锁
			switch (SysTask.PWM_SubState[GLASS_01])
			{
				case PWM_SUB_FEW: //正转
#if DEBUG
					u3_printf(" PWM 全速正转开锁\n");
#endif

					TIM_SetCompare3(TIM3, PWM_PERIOD); //修改PWM占空比 ,正转
					TIM_SetCompare4(TIM3, 0);
					break;

				case PWM_SUB_REV: //反转
#if DEBUG
					u3_printf(" PWM 全速反转开锁\n");
#endif

					TIM_SetCompare4(TIM3, PWM_PERIOD); //修改PWM占空比, 反转
					TIM_SetCompare3(TIM3, 0);
					break;

				default:
					break;
			}

			TIM_CtrlPWMOutputs(TIM3, ENABLE); // 使能输出PWM
			break;

		case PWM_STATE_STOP:
			TIM_SetCompare4(TIM3, 0); //
			TIM_SetCompare3(TIM3, 0); //
			TIM_CtrlPWMOutputs(TIM3, DISABLE); // 停止输出PWM，停机
		default:
			break;
	}

	u8StateSave 		= SysTask.PWM_State[GLASS_01];
}


/*******************************************************************************
* 名称: 
* 功能: 只有正反转的，转半圈 因为设置约束，电机信号线不能隔离
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void Moto_01_Task(void)
{
	//A电机
	switch (SysTask.Moto_State[GLASS_01])
	{
		case MOTO_STATE_INIT:
			if (SysTask.Moto_Mode[GLASS_01] == MOTO_FR_FWD_REV)
			{
				SysTask.Moto_Time[GLASS_01] = MOTO_TIME_ANGLE; //转一定角度
				SysTask.Moto_RunTime[GLASS_01] =
					 SysTask.nTick + g_au16MoteTime[SysTask.Moto_Time[GLASS_01]][1] +MOTO_DEVIATION_TIME; //加系统偏差
				SysTask.Moto_State[GLASS_01] = MOTO_STATE_FIND_ZERO;
				SysTask.Moto_ModeSave[GLASS_01] = SysTask.Moto_Mode[GLASS_01];


#if DEBUG_MOTO
				u3_printf("MOTO_STATE_INIT");
				u3_printf("上升，正转 去找原点。。\n");
#endif

				SysTask.Moto_SubState[GLASS_01] = MOTO_SUB_STATE_UP;

				//GPIO_SetBits(MOTO_P_GPIO, MOTO_01_PIN_P); //先正转
				//GPIO_ResetBits(MOTO_N_GPIO, MOTO_01_PIN_N); //
				SysTask.PWM_State[GLASS_01] = PWM_STATE_FEW_P; //先正转
			}
			else 
			{
				//如果此时，还没有回到原点？只有在开始还没有进入转动状态时按下平板的stop键才会进入，按道理这种情况非常少见，几乎没有
				//如果flash保存的是这种状态，则也有这种可能 
				SysTask.Moto_State[GLASS_01] = MOTO_STATE_STOP;
				SysTask.Moto_SubState[GLASS_01] = MOTO_SUB_STATE_DOWN;
				SysTask.Moto_RunTime[GLASS_01] = 0;
				SysTask.Moto_ModeSave[GLASS_01] = SysTask.Moto_Mode[GLASS_01];

			}

			break;

		case MOTO_STATE_FIND_ZERO:
			switch (SysTask.Moto_SubState[GLASS_01])
			{
				case MOTO_SUB_STATE_UP: //上升，正转
					if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_01_PIN) == 0) // 找到原点，
					{
#if DEBUG_MOTO
						u3_printf("MOTO_STATE_FIND_ZERO ");
						u3_printf("正转 找到原点，");
						u3_printf("\n");
#endif

						SysTask.Moto_State[GLASS_01] = MOTO_STATE_RUN_CHA;
						SysTask.Moto_SubState[GLASS_01] = MOTO_SUB_STATE_UP_F; //继续正转 forward
						SysTask.Moto_RunTime[GLASS_01] =
							 SysTask.nTick + g_au16MoteTime[SysTask.Moto_Time[GLASS_01]][1];
					}
					else if (SysTask.Moto_RunTime[GLASS_01] == 0) //转过一定的角度没有找到原点，返回去找原点
					{
#if DEBUG_MOTO
						u3_printf("MOTO_STATE_FIND_ZER");
						u3_printf("正转 没有到原点");
						u3_printf("\n");
#endif

						SysTask.Moto_SubState[GLASS_01] = MOTO_SUB_STATE_DOWN;

						//以临界正转终点为初始条件，前面已经正转一个角度，现在要先纠正回到之前位置再反转，所以时间要乘以 2
						//默认上一次关机是没有检测到零点时间加上MOTO_DEVIATION_TIME
						SysTask.Moto_RunTime[GLASS_01] =
							 SysTask.nTick + (g_au16MoteTime[SysTask.Moto_Time[GLASS_01]][1] +MOTO_DEVIATION_TIME + MOTO_DEVIATION_TIME) * 2 + MOTO_DEVIATION_TIME;

						//GPIO_SetBits(MOTO_N_GPIO, MOTO_01_PIN_N); //反转
						//GPIO_ResetBits(MOTO_P_GPIO, MOTO_01_PIN_P); //
						SysTask.PWM_State[GLASS_01] = PWM_STATE_REV_P;
					}

					break;

				case MOTO_SUB_STATE_DOWN: //下降， 反转
					if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_01_PIN) == 0) // 找到原点，
					{
#if DEBUG_MOTO
						u3_printf("MOTO_STATE_FIND_ZERO");
						u3_printf("反转 找到原点，\n");
#endif

						SysTask.Moto_State[GLASS_01] = MOTO_STATE_RUN_CHA;
						SysTask.Moto_SubState[GLASS_01] = MOTO_SUB_STATE_DOWN_F; //继续返转 forward
						SysTask.Moto_RunTime[GLASS_01] =
							 SysTask.nTick + g_au16MoteTime[SysTask.Moto_Time[GLASS_01]][1];
					}
					else if (SysTask.Moto_RunTime[GLASS_01] == 0) //转过一定的角度没有找到原点，零点失效，以当前角度为反转终点
					{
#if DEBUG_MOTO
						u3_printf("MOTO_STATE_FIND_ZERO");
						u3_printf("反转没有到原点\n");
#endif

						SysTask.Moto_State[GLASS_01] = MOTO_STATE_CHANGE_DIR; //从头开始正转

						g_bSensorState		= FALSE;

						//发送状态给平板端
						g_FingerAck 		= ACK_FAILED;
						g_AckType			= DETECT_ACK_TYPE;
						g_GlassSendAddr 	= GLASS_01;

						if (SysTask.SendState == SEND_IDLE)
							SysTask.SendState = SEND_TABLET_DETECT;
					}

					break;

				default:
					break;
			}

			break;

		case MOTO_STATE_CHANGE_DIR:
			SysTask.Moto_State[GLASS_01] = MOTO_STATE_RUN_CHA;
			SysTask.Moto_SubState[GLASS_01] = MOTO_SUB_STATE_UP_F;
			SysTask.Moto_ModeSave[GLASS_01] = SysTask.Moto_Mode[GLASS_01];

#if DEBUG_MOTO
			u3_printf("\n---------------正常运行状态-----------\n");
#endif

			break;

		case MOTO_STATE_RUN_CHA: //正反转运行状态， 只有这种状态 ，在这个模式下面
			switch (SysTask.Moto_SubState[GLASS_01])
			{
				case MOTO_SUB_STATE_UP: //上升，正转
					if (SysTask.Lock_State[GLASS_01] == LOCK_STATE_DEBOUNSE) //准备开锁，正转回去找原点 开锁. 这部分要在moto那里改，不可以在PWM那里改
					{
						SysTask.PWM_State[GLASS_01] = PWM_STATE_OPEN;
						SysTask.PWM_SubState[GLASS_01] = PWM_SUB_FEW;
						break;
					}

					if (SysTask.Moto_RunTime[GLASS_01] == 0) // 由时间控制 ，说明已经转了固定角度
					{
#if DEBUG_MOTO
						u3_printf("MOTO_SUB_STATE_UP");
						u3_printf("正转\n");
#endif

						SysTask.Moto_SubState[GLASS_01] = MOTO_SUB_STATE_ZERO_R;

						if (g_bSensorState == TRUE)
							SysTask.Moto_RunTime[GLASS_01] =
								 SysTask.nTick + g_au16MoteTime[SysTask.Moto_Time[GLASS_01]][1] +MOTO_DEVIATION_TIME; //下一步会去找零点，所以要加上一个系统偏差的时间
						else 
							SysTask.Moto_RunTime[GLASS_01] =
								 SysTask.nTick + g_au16MoteTime[SysTask.Moto_Time[GLASS_01]][1]; //没有感应到零点的情况下以时间的基准，不用加上偏差

						SysTask.PWM_State[GLASS_01] = PWM_STATE_FEW_P; //先正转
					}

					break;

				case MOTO_SUB_STATE_ZERO_R: //找零点
					if (SysTask.Lock_State[GLASS_01] == LOCK_STATE_DEBOUNSE) //准备开锁，正转回去找原点 开锁. 这部分要在moto那里改，不可以在PWM那里改
					{
						SysTask.PWM_State[GLASS_01] = PWM_STATE_OPEN;
						SysTask.PWM_SubState[GLASS_01] = PWM_SUB_FEW;
					}

					if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_01_PIN) == 0) // 找到原点，
					{
#if DEBUG_MOTO
						u3_printf(" MOTO_SUB_STATE_ZERO_R");
						u3_printf("正转 找到原点，\n");
#endif

						if (SysTask.Lock_State[GLASS_01] == LOCK_STATE_DEBOUNSE) //准备开锁，不做任何处理
							break;

