sforganization/20190613/0em/STM32F103_one_angle_module/HARDWARE/COMMENT/SysComment.c
						if (SysTask.Moto_Mode[GLASS_01] != SysTask.Moto_ModeSave[GLASS_01]) //状态改变，由转动进入停止状态时候会进入这个分支 
						{
#if DEBUG_MOTO
							u3_printf(" MOTO_SUB_STATE_ZERO_R");
							u3_printf("状态改变\n");
#endif

							SysTask.PWM_State[GLASS_01] = PWM_STATE_STOP;

							SysTask.Moto_State[GLASS_01] = MOTO_STATE_INIT; //先延时一段时间再翻转
							break;
						}

						SysTask.Moto_SubState[GLASS_01] = MOTO_SUB_STATE_UP_F;
						SysTask.Moto_RunTime[GLASS_01] =
							 SysTask.nTick + g_au16MoteTime[SysTask.Moto_Time[GLASS_01]][1];
					}
					else if (SysTask.Moto_RunTime[GLASS_01] == 0) //转过一定的角度没有找到原点
					{
#if DEBUG_MOTO
						u3_printf(" MOTO_SUB_STATE_ZERO_R");
						u3_printf("正转	没有找到原点，\n");
#endif

						SysTask.Moto_SubState[GLASS_01] = MOTO_SUB_STATE_UP_F;
						SysTask.Moto_RunTime[GLASS_01] =
							 SysTask.nTick + g_au16MoteTime[SysTask.Moto_Time[GLASS_01]][1];
					}

					break;

				case MOTO_SUB_STATE_UP_F: //继续正转 forward
					if (SysTask.Lock_State[GLASS_01] == LOCK_STATE_DEBOUNSE) //准备开锁，正转回去找原点 开锁. 这部分要在moto那里改，不可以在PWM那里改
					{
						SysTask.PWM_State[GLASS_01] = PWM_STATE_OPEN;
						SysTask.PWM_SubState[GLASS_01] = PWM_SUB_REV;
						break;
					}

					if (SysTask.Moto_RunTime[GLASS_01] == 0) // 由时间控制 ，说明已经转了固定角度
					{
#if DEBUG_MOTO
						u3_printf("MOTO_SUB_STATE_UP_F");
						u3_printf("继续正转，\n");
#endif

						SysTask.Moto_SubState[GLASS_01] = MOTO_SUB_STATE_DOWN;
					}

					break;

				case MOTO_SUB_STATE_DOWN: //下降， 反转
#if DEBUG_MOTO
					u3_printf("MOTO_SUB_STATE_DOWN");
					u3_printf("反转，\n");
#endif

					if (SysTask.Lock_State[GLASS_01] == LOCK_STATE_DEBOUNSE) //准备开锁，正转回去找原点 开锁. 这部分要在moto那里改，不可以在PWM那里改
					{
						SysTask.PWM_State[GLASS_01] = PWM_STATE_OPEN;
						SysTask.PWM_SubState[GLASS_01] = PWM_SUB_REV;
						break;
					}

					if (g_bSensorState == TRUE)
						SysTask.Moto_RunTime[GLASS_01] =
							 SysTask.nTick + g_au16MoteTime[SysTask.Moto_Time[GLASS_01]][1] + MOTO_DEVIATION_TIME;
					else 
						SysTask.Moto_RunTime[GLASS_01] =
							 SysTask.nTick + g_au16MoteTime[SysTask.Moto_Time[GLASS_01]][1];

					SysTask.PWM_State[GLASS_01] = PWM_STATE_REV_P;
					SysTask.Moto_SubState[GLASS_01] = MOTO_SUB_STATE_ZERO_L;
					break;

				case MOTO_SUB_STATE_ZERO_L: //找零点
					if (SysTask.Lock_State[GLASS_01] == LOCK_STATE_DEBOUNSE) //准备开锁，正转回去找原点 开锁. 这部分要在moto那里改，不可以在PWM那里改
					{
						SysTask.PWM_State[GLASS_01] = PWM_STATE_OPEN;
						SysTask.PWM_SubState[GLASS_01] = PWM_SUB_REV;
					}

					if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_01_PIN) == 0) // 找到原点，
					{
#if DEBUG_MOTO
						u3_printf(" MOTO_SUB_STATE_ZERO_L");
						u3_printf("找到原点，\n");
#endif

						if (SysTask.Lock_State[GLASS_01] == LOCK_STATE_DEBOUNSE) //准备开锁，不做任何处理
							break;

						if (SysTask.Moto_Mode[GLASS_01] != SysTask.Moto_ModeSave[GLASS_01]) //状态改变，由转动进入停止状态时候会进入这个分支 
						{
#if DEBUG_MOTO
							u3_printf(" MOTO_SUB_STATE_ZERO_L");
							u3_printf("状态改变\n");
#endif

							//GPIO_ResetBits(MOTO_P_GPIO, MOTO_01_PIN_P); //先暂停电机转动
							//GPIO_ResetBits(MOTO_N_GPIO, MOTO_01_PIN_N); //先暂停电机转动
							SysTask.PWM_State[GLASS_01] = PWM_STATE_STOP;
							SysTask.Moto_State[GLASS_01] = MOTO_STATE_INIT; //先延时一段时间再翻转
							break;
						}

						SysTask.Moto_SubState[GLASS_01] = MOTO_SUB_STATE_DOWN_F;
						SysTask.Moto_RunTime[GLASS_01] =
							 SysTask.nTick + g_au16MoteTime[SysTask.Moto_Time[GLASS_01]][1] + MOTO_DEVIATION_TIME;
					}
					else if (SysTask.Moto_RunTime[GLASS_01] == 0) //转过一定的角度没有找到原点，
					{
#if DEBUG_MOTO
						u3_printf("MOTO_SUB_STATE_ZERO_L");
						u3_printf("没有找到 原点，\n");
#endif

						if (SysTask.Lock_State[GLASS_01] == LOCK_STATE_DEBOUNSE) //准备开锁，不做任何处理
							break;

						if (SysTask.Moto_Mode[GLASS_01] != SysTask.Moto_ModeSave[GLASS_01]) //状态改变，由转动进入停止状态时候会进入这个分支 
						{
							SysTask.PWM_State[GLASS_01] = PWM_STATE_STOP;
							SysTask.PWM_SubState[GLASS_01] = PWM_SUB_INIT;

							SysTask.Moto_State[GLASS_01] = MOTO_STATE_INIT; //先延时一段时间再翻转
							break;
						}

						SysTask.Moto_SubState[GLASS_01] = MOTO_SUB_STATE_DOWN_F;
						SysTask.Moto_RunTime[GLASS_01] =
							 SysTask.nTick + g_au16MoteTime[SysTask.Moto_Time[GLASS_01]][1];
					}

					break;

				case MOTO_SUB_STATE_DOWN_F: //继续返转 forward
					if (SysTask.Lock_State[GLASS_01] == LOCK_STATE_DEBOUNSE) //准备开锁，正转回去找原点 开锁. 这部分要在moto那里改，不可以在PWM那里改
					{
						SysTask.PWM_State[GLASS_01] = PWM_STATE_OPEN;
						SysTask.PWM_SubState[GLASS_01] = PWM_SUB_FEW;
						break;
					}

					if (SysTask.Moto_RunTime[GLASS_01] == 0) // 由时间控制 ，说明 已经转了固定角度
					{
#if DEBUG_MOTO
						u3_printf("MOTO_SUB_STATE_DOWN_F");
						u3_printf("继续反转，\n");
						u3_printf("\n------------- 重复-------------\n");
#endif

						SysTask.Moto_SubState[GLASS_01] = MOTO_SUB_STATE_UP;
					}

					break;

				default:
					break;
			}

			break;

		case MOTO_STATE_STOP:
			if ((GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_01_PIN) == 0) ||
				 (SysTask.PWM_State[GLASS_01] == PWM_STATE_STOP)) //要求回到原点才开锁
			{
#if DEBUG_MOTO
				u3_printf(" MOTO_STATE_STOP 停止\n");
#endif

				//GPIO_ResetBits(MOTO_P_GPIO, MOTO_01_PIN_P); //先暂停电机转动
				//GPIO_ResetBits(MOTO_N_GPIO, MOTO_01_PIN_N); //先暂停电机转动
				SysTask.PWM_State[GLASS_01] = PWM_STATE_STOP;
				SysTask.Moto_State[GLASS_01] = MOTO_STATE_IDLE;
			}

			break;

		case MOTO_STATE_WAIT:
			break;

		case MOTO_STATE_IDLE:
			if (SysTask.Moto_Mode[GLASS_01] != SysTask.Moto_ModeSave[GLASS_01])
			{
				SysTask.Moto_State[GLASS_01] = MOTO_STATE_INIT; //先延时一段时间再翻转
				break;
			}

			break;

		default:
			break;
	}
}


/*******************************************************************************
* 名称: 
* 功能: 开锁任务，如果指纹识别正确则可以开锁，如果 在开锁状态下任意一个指纹按下?
	?关锁，没有录入的也可以关 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void Lock_01_Task(void)
{

	switch (SysTask.Lock_State[GLASS_01]) //_01锁
	{
		case LOCK_STATE_DETECT:
			if (SysTask.LockMode[GLASS_01] != SysTask.LockModeSave[GLASS_01])
			{
				if (SysTask.LockMode[GLASS_01] == LOCK_ON) //将要开锁
				{
					SysTask.Lock_StateTime[GLASS_01] = MOTO_DEBOUNCE; //延时
					SysTask.Lock_State[GLASS_01] = LOCK_STATE_DEBOUNSE;
					SysTask.LockModeSave[GLASS_01] = SysTask.LockMode[GLASS_01];
					SysTask.Lock_OffTime[GLASS_01] = LOCK_OFFTIME;
					GPIO_SetBits(LED_GPIO, LED_PIN_SINGLE);
				}
				else //将要关锁
				{
					SysTask.LockModeSave[GLASS_01] = SysTask.LockMode[GLASS_01];
					SysTask.Lock_StateTime[GLASS_01] = SysTask.nTick + LOCK_SET_L_TIME;
					SysTask.Lock_State[GLASS_01] = LOCK_STATE_SENT;
					GPIO_ResetBits(LED_GPIO, LED_PIN_SINGLE);
				}
			}

			break;

		case LOCK_STATE_DEBOUNSE: //
			if (SysTask.Lock_StateTime[GLASS_01] == 0)
			{
				if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_01_PIN) != 0) //要求回到原点才开锁
					break;

#if DEBUG
				u3_printf(" lock 开锁。。。。。\n");
#endif

				SysTask.Moto_WaitTime[GLASS_01] = MOTO_DEBOUNCE;
				SysTask.Moto_State[GLASS_01] = MOTO_STATE_STOP; //停止转动

				SysTask.Lock_State[GLASS_01] = LOCK_STATE_OPEN;


