sforganization/20190613/0em/STM32F103_one_angle_module/HARDWARE/COMMENT/SysComment.c
				GPIO_ResetBits(LOCK_GPIO, LOCK_01_PIN); //开锁
				SysTask.Lock_StateTime[GLASS_01] = SysTask.nTick + LOCK_HAL_OPEN;
			}

			break;

		case LOCK_STATE_OPEN:
			if (SysTask.Lock_StateTime[GLASS_01] != 0)
				break;

#if DEBUG
			u3_printf(" lock 停止开锁信号发送\n");
#endif

			GPIO_SetBits(LOCK_GPIO, LOCK_01_PIN); //停止开锁信号发送
			SysTask.Lock_State[GLASS_01] = LOCK_STATE_DETECT;

			if (SysTask.SendState == SEND_IDLE)
				SysTask.SendState = SEND_TABLET_ZERO;

			g_FingerAck = ACK_SUCCESS;
			g_AckType = ZERO_ACK_TYPE;
			g_GlassSendAddr = GLASS_01;
			break;

		case LOCK_STATE_SENT:
			if (SysTask.Lock_StateTime[GLASS_01] != 0)
				break;

#if DEBUG
			u3_printf(" lock 开关锁。。。。。\n");
#endif

			GPIO_ResetBits(LOCK_GPIO, LOCK_01_PIN); //开锁和关锁都 是发送一个短时间的高电平 
			SysTask.Lock_State[GLASS_01] = LOCK_STATE_OFF;
			SysTask.Lock_StateTime[GLASS_01] = LOCK_HAL_OPEN; ////延时
			break;

		case LOCK_STATE_OFF: //
			if (SysTask.Lock_StateTime[GLASS_01] != 0)
				break;

			GPIO_SetBits(LOCK_GPIO, LOCK_01_PIN); //停止开锁信号发送
			SysTask.Lock_StateTime[GLASS_01] = SysTask.nTick + LOCK_SET_L_TIME;
			SysTask.Lock_State[GLASS_01] = LOCK_STATE_DETECT;

			// 因为转动的单片机没有应答我们这边  ，所以这个不用上传到平板端，默认是转动一开始就是成功的
			//			if (SysTask.SendState == SEND_IDLE)
			//				SysTask.SendState = SEND_TABLET_FINGER;
			//			g_FingerAck = ACK_SUCCESS;
			//			g_AckType = ZERO_ACK_TYPE;
			//			g_GlassSendAddr = GLASS_01;
			//	点击了转动，这里让他转动起来,且要延时一段时间，主关锁完全 之后再转动
			SysTask.Moto_StateTime[GLASS_01] = MOTO_LOCK_SUCCESS;
			SysTask.Moto_State[GLASS_01] = MOTO_STATE_INIT; //重新开始转动
			break;

		default:
			break;
	}
}


/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void SysSaveDataTask(void)
{
	static u8 u8Status	= 0;
	static u8 u8count	= 0;
	u8 i;

	if (SysTask.bEnSaveData == FALSE)
		return;

	switch (u8Status)
	{
		case SAVE_INIT:
			memset(SysTask.FlashData.u8FlashData, 0, sizeof(SysTask.FlashData.u8FlashData)); //清0

			//				memcpy(SysTask.FlashData.u8FlashData, SysTask.WatchState, sizeof(SysTask.WatchState));
			for (i = 0; i < GLASS_MAX_CNT; i++)
			{
				SysTask.FlashData.Data.WatchState[i].MotoTime = SysTask.WatchState[i].MotoTime;
				SysTask.FlashData.Data.WatchState[i].u8Dir = SysTask.WatchState[i].u8Dir;
				SysTask.FlashData.Data.WatchState[i].u8LockState = SysTask.WatchState[i].u8LockState;
			}

			SysTask.FlashData.Data.u16FingerfCnt = SysTask.u16FingerfCnt;
			SysTask.FlashData.Data.u16LedMode = LED_MODE_DEF; //LED模式
			u8Status = SAVE_WRITE;
			break;

		case SAVE_WRITE:
			if (FLASH_WriteMoreData(g_au32DataSaveAddr[SysTask.u16AddrOffset], SysTask.FlashData.u16FlashData, DATA_READ_CNT + LED_MODE_CNT + FINGER_CNT))
			{
				u8count++;
				u8Status			= SAVE_WAIT;
				SysTask.u16SaveWaitTick = 100;		// 100ms 延时再重新写入
			}
			else 
			{
				u8Status			= SAVE_EXIT;
			}

			break;

		case SAVE_WAIT:
			if (SysTask.u16SaveWaitTick == 0)
			{
				u8Status			= SAVE_WRITE;

				if (u8count++ >= 7) //每页尝试8次
				{
					if (++SysTask.u16AddrOffset < ADDR_MAX_OFFSET) //共5页
					{
						for (i = 0; i < 3; i++) //重写8次最多
						{
							if (!FLASH_WriteMoreData(g_au32DataSaveAddr[0], &SysTask.u16AddrOffset, 1))
								break;

							delay_ms(20);
						}
					}
					else 
					{
						u8Status			= SAVE_EXIT;
					}
				}
			}

			break;

		case SAVE_EXIT:
			SysTask.bEnSaveData = FALSE;
			u8Status = SAVE_INIT;
			u8count = 0;
			break;

		default:
			u8Status = SAVE_EXIT;
			break;
	}
}


/*******************************************************************************
* 名称: 
* 功能:按键任务
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void KeyTask(void)
{
	int pressTime		= 0;

	switch (SysTask.Key_State)
	{
		case KEY_INIT:
			if (!GPIO_ReadInputDataBit(KEY_GPIO, KEY_01_PIN))
			{
				SysTask.KeyStateTime = KEY_PRESS_TIME;
				SysTask.Key_State	= KEY_DEBOUCH;
			}

			break;

		case KEY_DEBOUCH:
			if (!GPIO_ReadInputDataBit(KEY_GPIO, KEY_01_PIN))
				break;

			pressTime = KEY_PRESS_TIME - SysTask.KeyStateTime;

			if (SysTask.TouchState != TOUCH_MATCH_INIT) //指纹模块还在其他 的任务状态 里面没有出来 ，等待指纹 模块任务状态 退出之后 再进入
				return;

			if (pressTime < KEY_DEBOUCH_TIME)
			{ //抖动
				SysTask.Key_State	= KEY_INIT;
			}
			else if (pressTime < KEY_SHORT_TIME)
			{
				SysTask.Key_State	= KEY_ADD_USER;
			}
			else 
			{
				SysTask.Key_State	= KEY_CLR_USER;
			}

			break;

		case KEY_ADD_USER:
#if DEBUG
			u3_printf("短按，添加用户\n");
#endif

			SysTask.TouchState = TOUCH_KEY_SHORT;
			SysTask.TouchSub = TOUCH_SUB_INIT;
			SysTask.Key_State = KEY_WAIT;
			SysTask.KeyStateTime = 400; //延时一定时间再允许操作key
			break;

		case KEY_CLR_USER:
#if DEBUG
			u3_printf("长按，删除用户\n");
#endif

			SysTask.TouchState = TOUCH_DEL_USER;
			SysTask.Key_State = KEY_WAIT;
			SysTask.KeyStateTime = 400; //延时一定时间再允许操作key
			break;

		case KEY_WAIT:
			if ((SysTask.KeyStateTime != 0) || (SysTask.TouchState != TOUCH_MATCH_INIT)) //增加删除用户需要一定的时间
				break;

#if DEBUG
			u3_printf("-----重启按键任务-----\n");
#endif

			SysTask.Key_State = KEY_INIT;
			break;

		default:
			break;
	}

}





/*
const tNote AllBGM[]=
{
	//两只老虎  36  BEGIN_BGM
	{CM1,TT/4},{CM2,TT/4},{CM3,TT/4},{CM1,TT/4},
	{CM1,TT/4},{CM2,TT/4},{CM3,TT/4},{CM1,TT/4},
	{CM3,TT/4},{CM4,TT/4},{CM5,TT/4},{0,TT/4},
	{CM3,TT/4},{CM4,TT/4},{CM5,TT/4},{0,TT/4},
	{CM5,TT/8},{CM6,TT/8},{CM5,TT/8},{CM4,TT/8},{CM3,TT/4},{CM1,TT/4},
	{CM5,TT/8},{CM6,TT/8},{CM5,TT/8},{CM4,TT/8},{CM3,TT/4},{CM1,TT/4},
	{CM1,TT/4},{CL5,TT/4},{CM1,TT/4},{0,TT/4},
	{CM1,TT/4},{CL5,TT/4},{CM1,TT/4},{0,TT/4},
};
*/
const Note_T AllBGM[]=
{
	//击中   5    BAD_BGM
	//{CM1,TT1/4},{CL4,TT1/4},{CL3,TT1/8},{CL1,TT1/8},{0,TT1/8},
	// 生成  4   GOOD_BGM
	//{CH1,TT1/4},{CH2,TT1/4},{CH3,TT1/4},{0,TT1/8},
	//两只老虎  36  BEGIN_BGM
//	{CM1,TT/4},{CM2,TT/4},{CM3,TT/4},{CM1,TT/4},
//	{CM1,TT/4},{CM2,TT/4},{CM3,TT/4},{CM1,TT/4},
//	{CM3,TT/4},{CM4,TT/4},{CM5,TT/4},{0,TT/4},
//	{CM3,TT/4},{CM4,TT/4},{CM5,TT/4},{0,TT/4},
//	{CM5,TT/8},{CM6,TT/8},{CM5,TT/8},{CM4,TT/8},{CM3,TT/4},{CM1,TT/4},
//	{CM5,TT/8},{CM6,TT/8},{CM5,TT/8},{CM4,TT/8},{CM3,TT/4},{CM1,TT/4},
//	{CM1,TT/4},{CL5,TT/4},{CM1,TT/4},{0,TT/4},
//	{CM1,TT/4},{CL5,TT/4},{CM1,TT/4},{0,TT/4},
    //{0, 0},{0xFFFF, 0xFFFF},   //结束标识 
    
