sforganization/20190613/0em/STM32F103_one_angle_module/HARDWARE/COMMENT/SysComment.c
	//小猪佩奇  12   LIFE_BGM
	{CH5,TTS/4},{CH3,TTS/8},{CH1,TTS/8},{CH2,TTS/4},{CM5,TTS/4},
	{CM5,TTS/8},{CM7,TTS/8},{CH2,TTS/8},{CH4,TTS/8},{CH3,TTS/4},{CH1,TTS/4},{0,TT/4},
    //{0,TT/4},{0, 10},{0xFFFF, 0xFFFF},   //结束标识 
    
	//坦克大战 33   LEVEL_BGM
	{CM1,TT1/4},{CM2,TT1/4},{0,TT1/4},{CM3,TTS/4},
	{CM1,TT1/4},{CM2,TT1/4},{0,TT1/4},{CM3,TTS/4},
	{CM3,TT1/4},{CM4,TT1/4},{0,TT1/4},{CM5,TTS/4},
	{CM3,TT1/4},{CM4,TT1/4},{0,TT1/4},{CM5,TTS/4},
	{CM4,TT1/4},{CM5,TT1/4},{0,TT1/4},{CM6,TTS/4},
	{CM4,TT1/4},{CM5,TT1/4},{0,TT1/4},{CM6,TTS/4},
	{CM5,TT1/4},{CM7,TT1/4},{0,TT1/4},{CH1,TTS/4},
	{CM5,TT1/4},{CM7,TT1/4},{0,TT1/4},{CH1,TTS/4},{0,TTS/4},
    {0, 10},{0xFFFF, 0xFFFF},   //结束标识 
};


static vu8 g_toneIndex = 0;


/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void BeepTask(void)
{


//	SysTask.BeepState = BEEP_STATE_INIT;
//    

//    if(SysTask.u16BeepWaitTime != 0)
//        return;
//    
//	BeepSound(AllBGM[g_toneIndex].mName, 3);
//    SysTask.u16BeepWaitTime = AllBGM[g_toneIndex].mTime;
//	g_toneIndex++;

//    if((AllBGM[g_toneIndex].mTime == 0xFFFF) && (AllBGM[g_toneIndex].mName == 0xFFFF))
//    {
//        SysTask.u16BeepWaitTime = 50;
//        g_toneIndex = 0;
//    }
}

/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void MainTask(void)
{
	SysSaveDataTask();
	KeyTask();
	FingerTouchTask();								//指纹模块
	Moto_01_Task(); 								//只有正反转的
	PWM_01_Task();
	Lock_01_Task();
	LedTask();
	LedStreamTask();
    BeepTask();
}


/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void SysEventInit(void)
{
	g_FingerEvent.bInit = TRUE;
	g_FingerEvent.bMutex = FALSE;
	g_FingerEvent.MachineCtrl.pData = (void *)
	malloc(sizeof(FingerData_t));
	g_FingerEvent.MachineCtrl.CallBack = Finger_Event;
	g_FingerEvent.MachineCtrl.u16InterValTime = 5;	//5ms 进入一次

	g_FingerEvent.MachineRun.bEnable = TRUE;
	g_FingerEvent.MachineRun.u32StartTime = 0;
	g_FingerEvent.MachineRun.u32LastTime = 0;
	g_FingerEvent.MachineRun.u32RunCnt = 0;
	g_FingerEvent.MachineRun.bFinish = FALSE;
	g_FingerEvent.MachineRun.u16RetVal = 0;
}


/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void SysInit(void)
{
	u8 i, j;

	SysTask.u16AddrOffset = FLASH_ReadHalfWord(g_au32DataSaveAddr[0]); //读取
	memset(SysTask.FlashData.u8FlashData, 0, sizeof(SysTask.FlashData.u8FlashData));

	if ((SysTask.u16AddrOffset == 0xffff) || (SysTask.u16AddrOffset >= ADDR_MAX_OFFSET) ||
		 (SysTask.u16AddrOffset == 0)) //初始状态 flash是0xffff
	{
		SysTask.u16AddrOffset = 1;					//从第一页开始写入

		for (i = 0; i < 8; i++) //重写8次最多
		{
			if (!FLASH_WriteMoreData(g_au32DataSaveAddr[0], &SysTask.u16AddrOffset, 1))
				break;

			delay_ms(20);
		}

		for (i = 0; i < GLASS_MAX_CNT; i++)
		{
			SysTask.WatchState[i].u8LockState = 0;
			SysTask.WatchState[i].u8Dir = MOTO_FR_FWD;
			SysTask.WatchState[i].MotoTime = MOTO_TIME_650;

			if (i == 0)
			{
				SysTask.WatchState[i].u8Dir = MOTO_FR_FWD_REV; //只有正反转和停止模式，别无选择
			}
		}

		//			memcpy(SysTask.FlashData.u8FlashData, SysTask.WatchState, sizeof(SysTask.WatchState));
		for (i = 0; i < GLASS_MAX_CNT; i++)
		{
			SysTask.FlashData.Data.WatchState[i].MotoTime = SysTask.WatchState[i].MotoTime;
			SysTask.FlashData.Data.WatchState[i].u8Dir = SysTask.WatchState[i].u8Dir;
			SysTask.FlashData.Data.WatchState[i].u8LockState = SysTask.WatchState[i].u8LockState;
		}

		SysTask.FlashData.Data.u16LedMode = LED_MODE_ON; //LED模式

		FLASH_WriteMoreData(g_au32DataSaveAddr[SysTask.u16AddrOffset], SysTask.FlashData.u16FlashData, sizeof(SysTask.FlashData.u16FlashData) / 2);
	}

	FLASH_ReadMoreData(g_au32DataSaveAddr[SysTask.u16AddrOffset], SysTask.FlashData.u16FlashData, sizeof(SysTask.FlashData.u16FlashData) / 2);

	for (i = 0; i < DATA_READ_CNT; i++)
	{
		if (SysTask.FlashData.u16FlashData[i] == 0xFFFF) //读出的FLASH有错，说明页就有问题，等待保存时再进行重新校验写入哪一页
		{
			for (j = 0; j < GLASS_MAX_CNT; j++)
			{
				SysTask.WatchState[j].u8LockState = 0;
				SysTask.WatchState[j].u8Dir = MOTO_FR_FWD;
				SysTask.WatchState[j].MotoTime = MOTO_TIME_650;

				if (i == 0)
				{
					SysTask.WatchState[i].u8Dir = MOTO_FR_FWD_REV; //只有正反转和停止模式，别无选择
				}
			}

			//memcpy(SysTask.FlashData.u8FlashData, SysTask.WatchState, sizeof(SysTask.WatchState));
			for (i = 0; i < GLASS_MAX_CNT; i++)
			{
				SysTask.FlashData.Data.WatchState[i].MotoTime = SysTask.WatchState[i].MotoTime;
				SysTask.FlashData.Data.WatchState[i].u8Dir = SysTask.WatchState[i].u8Dir;
				SysTask.FlashData.Data.WatchState[i].u8LockState = SysTask.WatchState[i].u8LockState;
			}

			//SysTask.FlashData.Data.u16FingerfCnt = SysTask.u16FingerfCnt;
			//SysTask.FlashData.Data.u16LedMode = LED_MODE_ON; //LED模式
			break;
		}

	}

	//		使用memcpy会导致TIM 2 TICk无法进入中断，其他串口中断没有受到影响，原因未知，复制8个是没有问题
	//		复制9个以上就会出现。
	//		memcpy(SysTask.WatchState, SysTask.FlashData.u8FlashData, 10);
	for (i = 0; i < GLASS_MAX_CNT; i++)
	{
		SysTask.WatchState[i].MotoTime = SysTask.FlashData.Data.WatchState[i].MotoTime;
		SysTask.WatchState[i].u8Dir = SysTask.FlashData.Data.WatchState[i].u8Dir;

		//			SysTask.WatchState[i].u8LockState	= SysTask.FlashData.Data.WatchState[i].u8LockState;  //锁状态现在不用上传，由下边单片机保证
	}

	SysTask.LED_Mode	= SysTask.FlashData.Data.u16LedMode;
	SysTask.u16FingerfCnt = SysTask.FlashData.Data.u16FingerfCnt;

	if ((SysTask.LED_Mode != LED_MODE_ON) && (SysTask.LED_Mode != LED_MODE_OFF))
	{
		SysTask.LED_Mode	= LED_MODE_ON;			//LED模式
	}

	for (i = 0; i < GLASS_MAX_CNT; i++)
	{
		SysTask.Moto_Mode[i] = (MotoFR) (SysTask.WatchState[i].u8Dir);
		SysTask.Moto_Time[i] = (MotoTime_e) (SysTask.WatchState[i].MotoTime);
		SysTask.Moto_RunTime[i] = g_au16MoteTime[SysTask.Moto_Time[i]][1];
		SysTask.Moto_WaitTime[i] = g_au16MoteTime[SysTask.Moto_Time[i]][2];
		SysTask.LockMode[i] = LOCK_OFF; 			//锁状态不在此更新，因为开锁需要密码之后
	}

	SysTask.TouchSub	= TOUCH_SUB_INIT;
	SysTask.bEnFingerTouch = FALSE;
	SysTask.nTick		= 0;
	SysTask.u16SaveTick = 0;
	SysTask.bEnSaveData = FALSE;

	SysTask.TouchState	= TOUCH_CHECK;				//优先设置指纹模式
	FINGER_POWER_ON();								//给指纹模块DSP上电，，后面会检查一次指纹ID 是否与  EEPRO		M  一致
	SysTask.u32TouchWaitTime = POWER_ON_DELAY;		//


	SysTask.SendState	= SEND_IDLE;
	SysTask.SendSubState = SEND_SUB_INIT;
	SysTask.bTabReady	= FALSE;
	SysTask.LED_ModeSave = LED_MODE_DEF;			// 保证第一次可以运行模式
	SysTask.Stream_State = STREAM_STATE_INIT;
	SysTask.u32StreamTime = 0;
	SysTask.Key_State	= KEY_INIT;
	SysTask.KeyStateTime = 0;
	SysTask.u8StreamShoWCnt = 0;
	SysTask.u8Usart1RevTime = 0;
	SysTask.u8Usart2RevTime = 0;
	SysTask.u16BeepWaitTime = 0;
	SysTask.BeepState = BEEP_STATE_INIT;
    

    


	for (i = 0; i < GLASS_MAX_CNT; i++)
	{
		SysTask.LockModeSave[i] = LOCK_OFF;
		SysTask.LockMode[i] = LOCK_OFF;
	}


	for (i = 0; i < GLASS_MAX_CNT; i++)
	{
		SysTask.PWM_State[i] = PWM_STATE_INIT;
		SysTask.PWM_SubState[i] = PWM_SUB_INIT;

	}

	for (i = 0; i < GLASS_MAX_CNT; i++)
	{
		SysTask.Moto_StateTime[i] = 0;
		SysTask.Moto_State[i] = MOTO_STATE_INIT;	//保证开机起来会转
		SysTask.Moto_SubState[i] = MOTO_SUB_STATE_RUN;
		SysTask.Lock_StateTime[i] = 0;				//			
	}

	SysEventInit();

	//		SysTask.u16BootTime = 3000;	//3秒等待从机启动完全
}


